# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [5]:
# import numpy and pandas
import numpy as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [6]:
# Run this code:

salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [7]:
# Your code here:
salaries.head(10)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
5,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,F,Salary,NaN,50436.0,NaN
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
8,"ABBATEMARCO, JAMES J",FIRE ENGINEER-EMT,FIRE,F,Salary,NaN,103350.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [8]:
salaries.shape

(33183, 8)

In [9]:
# Your code here:
salaries.isnull().sum().sort_values(ascending=False).head(10)

Hourly Rate          25161
Typical Hours        25161
Annual Salary         8022
Salary or Hourly         0
Full or Part-Time        0
Department               0
Job Titles               0
Name                     0
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [10]:
# Your code here:
salaries['Salary or Hourly'].value_counts()

Salary    25161
Hourly     8022
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [11]:
# Your code here:
department = salaries.groupby(['Department']).agg({'Name': 'count'})
department.sort_values(by='Name',ascending=False).head(10)

                   Name
Department
POLICE            13414
FIRE               4641
STREETS & SAN      2198
OEMC               2102
WATER MGMNT        1879
AVIATION           1629
TRANSPORTN         1140
PUBLIC LIBRARY     1015
GENERAL SERVICES    980
FAMILY & SUPPORT    615

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [12]:
salaries['Hourly Rate']

0          NaN
1          NaN
2          NaN
3          NaN
4        19.86
         ...
33178      NaN
33179      NaN
33180      NaN
33181      NaN
33182      NaN
Name: Hourly Rate, Length: 33183, dtype: float64

In [13]:
# Your code here:
checkPValue = lambda p,threshold=0.05: "--> Null(H0) hypotesis rejected" if p < threshold else "--> We cannot reject the null hypotesis"

In [14]:
# Your code here:
import matplotlib.pyplot as plt
from scipy import stats

resA = stats.ttest_1samp(salaries['Hourly Rate'],30.0, nan_policy='omit')
print(resA)
print(checkPValue(resA.pvalue))

Ttest_1sampResult(statistic=20.619805785494147, pvalue=4.323024048614701e-92)
--> Null(H0) hypotesis rejected

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [15]:
police = salaries[salaries['Department'] == 'POLICE']
police

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
...,...,...,...,...,...,...,...,...
33177,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN

In [16]:
police.describe()

       Typical Hours  Annual Salary  Hourly Rate
count           10.0   13404.000000    10.000000
mean            20.0   86486.414503     9.384000
std              0.0   18272.228294     0.098116
min             20.0   38376.000000     9.270000
25%             20.0   84054.000000     9.270000
50%             20.0   90024.000000     9.460000
75%             20.0   94524.000000     9.460000
max             20.0  260004.000000     9.460000

In [17]:
resA = stats.ttest_1samp(police['Annual Salary'],86000,nan_policy='omit')
print(resA)
print(checkPValue(resA.pvalue))
# el mean de la tabla tiene un valor parecido, pero la media de police.describe() tiene en cuenta los NaN

Ttest_1sampResult(statistic=3.081997005712994, pvalue=0.00206034035510054)
--> Null(H0) hypotesis rejected

Using the `crosstab` function, find the department that has the most hourly workers.

In [18]:
# Your code here:
pd.crosstab(salaries['Department'],salaries['Salary or Hourly']).sort_values(by='Hourly',ascending=False).head(5)

Salary or Hourly  Hourly  Salary
Department
STREETS & SAN       1862     336
WATER MGMNT         1513     366
OEMC                1273     829
AVIATION            1082     547
GENERAL SERVICES     765     215

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [19]:
# Your code here:
streets_san = salaries[salaries['Department'] == 'STREETS & SAN']
resA = stats.ttest_1samp(streets_san['Hourly Rate'],35,nan_policy='omit')
print(resA)
print(checkPValue(resA.pvalue))
# el mean de la tabla tiene un valor parecido, pero la media de streets_san.describe() tiene en cuenta los NaN.
# el salario de los streets & san es diferente de $35/hour

Ttest_1sampResult(statistic=-9.567447887848152, pvalue=3.3378530564710738e-21)
--> Null(H0) hypotesis rejected

In [20]:
streets_san.describe()

       Typical Hours  Annual Salary  Hourly Rate
count    1862.000000     336.000000  1862.000000
mean       37.137487   83019.250000    33.728378
std         8.777897   21254.991182     5.735242
min        10.000000   31872.000000    19.500000
25%        40.000000   70056.000000    35.600000
50%        40.000000   84168.000000    35.600000
75%        40.000000   97740.000000    36.210000
max        40.000000  154428.000000    53.100000

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [21]:
salaries.shape[0]

33183

In [24]:
# Your code here:
# alpha = 95% confidence interval

error = stats.sem(salaries['Hourly Rate'],nan_policy = "omit")
#t.interval(0.95, salaries, loc=30, scale=salaries.shape[0]-1)
#interval(alpha, df, loc=0, scale=1)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [25]:
# Your code here:
stats.t.interval(0.95, len(salaries['Hourly Rate'])-1, loc=np.mean(salaries['Hourly Rate']), scale=error)

(32.52348867934239, 33.05362675322017)

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [33]:
# Your code here:
#!pip3 install statsmodels

In [ ]:
proportions_ztest
>>> count = 5
>>> nobs = 83
>>> value = .05
>>> stat, pval = proportions_ztest(count, nobs, value)
>>> print('{0:0.3f}'.format(pval))
0.695